Tekla Open API Reference for Tekla Structures 2025
SeamInputTypeAttribute Constructor
Overload List
Name | Description
SeamInputTypeAttribute(Int32)
 The custom attribute [SeamInputType()] uses this to store the input type to the system. This is not to be used by itself.
SeamInputTypeAttribute(ConnectionBase.SeamInputType)
 The custom attribute [SeamInputType()] uses this to store the input type to the system. This is not to be used by itself.
Top
See Also
Reference
SeamInputTypeAttribute Class
Tekla.Structures.Plugins Namespace